advanced/frontend/controllers/CategoryController.php

SELECT * FROM `com_category`
---
    public function actionCate_add(){
      //判断是不是post传值
      if(\Yii::$app->request->post()){
        $comObj = new ComCategory;
        $re = \Yii::$app->request;
        // print_r(\Yii::$app->request->post());die;
        $comObj->cate_name = $re->post('cate_name');
        $comObj->sort      = $re->post('sort');
        $comObj->parent_id = $re->post('parent_id');
        // print_r($re->post());die;
        $result = $comObj->save();
        if($result){
          $this->redirect('?r=category/cate_list');
        }else{
          die("<script>alert('网络错误，添加失败');location.href='?r=category/cate_add'</script>");
        }
        // echo "post";die;
      }else{
        $arr = ComCategory::find();
        $str = $arr->select('*')
                  ->from('com_category')
                  ->asArray()
                  ->all();

SELECT COUNT(*) FROM `com_category`
SELECT * FROM `com_category` LIMIT 10
---
    public function actionCate_list(){
         $arr = ComCategory::find();
         $pages = new Pagination([
            'totalCount'=>$arr->count(),//总记录数
            'pageSize'=>10            //每页显示的条数
         ]);
         $str = $arr->select('*')
                    ->from('com_category')
                    ->offset($pages->offset)
                    ->limit($pages->limit)
                    ->asArray()
                    ->all();