advanced/frontend/controllers/LoginController.php

SELECT `id` FROM `admin` WHERE `username`='admin'
SELECT `id` FROM `admin` WHERE (`username`='123') AND (`pwd`='202cb962ac59075b964b07152d234b70')
---
    public function actionDologin(){
      //接值
      $res = \Yii::$app->request;
      $db  = \Yii::$app->db;
      $username = $res->post('username');
      $pwd      = md5($res->post('pwd'));
      // echo $username;
      // echo $pwd;
      // die;
      $userObj = new Admin;
      $arr = Admin::find();
      $str = $arr->select("id")
                ->from('admin')
                ->where(['username'=>"$username"])
                ->asArray()
                ->all();
      if(!$str){
          die("Sorry, user name does not exist");
      }else{
        $res = $arr->select("id")
                ->from('admin')
                ->where(['username'=>"$username",'pwd'=>"$pwd"])
                ->asArray()
                ->all();