advanced/frontend/controllers/LoginController.php

    public function actionIndex(){
      //查询出所有的用户类型  循环到注册页面的下拉框中
      // $type = new CustomerType;
      $arr = CustomerType::find();
      $str = $arr->select('*')
                ->from('customer_type')
                ->asArray()
                ->all();
---
SELECT * FROM `customer_type`

    public function actionDologin(){
      //接值
      $res = \Yii::$app->request;
      $db  = \Yii::$app->db;
      $username = $res->post('username');
      $pwd      = md5($res->post('pwd'));
      // echo $username;
      // echo $pwd;
      // die;
      $userObj = new Admin;
      $arr = Admin::find();
      $str = $arr->select("id,username")
                ->from('admin')
                ->where(['username'=>"$username"])
                ->asArray()
                ->all();
      $str = implode(array_column($str,'username'));
      // echo $username;
      // echo "<br>";
      // echo $str;
      $re = strcmp($username,$str);
      if($re!=0){
        die("<script>alert('请正确输入用户名');location.href='?r=login/index'</script>");
      }
      if(!$str){
          die("Sorry, user name does not exist");
      }else{
        $res = $arr->select("id")
                ->from('admin')
                ->where(['username'=>"$username",'pwd'=>"$pwd"])
                ->asArray()
                ->all();
---
SELECT `id`, `username` FROM `admin` WHERE `username`='admin'
SELECT `id` FROM `admin` WHERE (`username`='admin') AND (`pwd`='21232f297a57a5a743894a0e4a801fc3')