advanced/frontend/controllers/PositionController.php

SELECT * FROM `pos_category`
---
    public function actionPosition_add(){
      //判断是不是post传值
      if(\Yii::$app->request->post()){
        $poscategory = new PosCategory;
        $re = \Yii::$app->request;
        // print_r(\Yii::$app->request->post());die;
        $poscategory->cate_name = $re->post('cate_name');
        $poscategory->cate_id   = $re->post('cate_id');
        $poscategory->sort      = $re->post('sort');
        $result = $poscategory->save();
        if($result){
          $this->redirect('?r=position/position_list');
        }else{
          die("<script>alert('网络错误，添加失败');location.href='?r=position/position_add'</script>");
        }
        // echo "post";die;
      }else{
        $arr = PosCategory::find();
        $str = $arr->select('*')
                  ->from('pos_category')
                  ->asArray()
                  ->all();