advanced/frontend/controllers/ResumeController.php

	public function actionResume_list()
	{
		$session = \YII::$app->session;
        $name = $session->get("username");
		 if(\Yii::$app->request->post())
	 {
        $post=yii::$app->request->post();
        $rel=\yii::$app->db->createCommand()->insert('resume',$post)->execute();
        // print_r(\Yii::$app->request->post());die;
        if($rel){
          $this->redirect('?r=resume/resume_list');
        }else{
          die("<script>alert('网络错误，添加失败');location.href='?r=resume/resume_add'</script>");
        }
        // echo "post";die;
      }else{
        $query=new \yii\db\Query();
        $info=$query->select(['id','realname','teach','major','sex','address','mobile','email','introduce','experience'])->from('resume')->all();
---
SELECT `id`, `realname`, `teach`, `major`, `sex`, `address`, `mobile`, `email`, `introduce`, `experience` FROM `resume`

	public function actionDel()
	{
		$request=\yii::$app->request;
        $con=\yii::$app->db;
        $id=$request->get('id');
        $res=$con->createCommand()->delete('resume',['id'=>$id])->execute();
---
DELETE FROM `resume` WHERE `id`='1'

	public function actionRevise()
	{
		$request=\yii::$app->request;
		$id=$request->get('id');
		$query=new \yii\db\Query();
		$info=$query->select(['id','realname','teach','major','sex','address','mobile','email','introduce','experience'])->from('resume')->where('id='.$id)->one();
---
SELECT `id`, `realname`, `teach`, `major`, `sex`, `address`, `mobile`, `email`, `introduce`, `experience` FROM `resume` WHERE id=1