advanced/frontend/controllers/UcenterController.php

    public function actionIndex()
    {
        //获取session里的 id  根据id查询该用户的推广链接的浏览量
        $session = \YII::$app->session;
        $username = $session->get("username");
        $id = $session->get("admin_id");
        $id = base64_encode($id); //id用base64加密
        // echo $username;
        // echo $id;die;
        $userObj = new Admin;
        $arr = Admin::find();
        $click_nums = $arr->select("click_num")
                  ->from('admin')
                  ->where(['username'=>"$username"])
                  ->asArray()
                  ->all();
---
SELECT `click_num` FROM `admin` WHERE `username`='admin'